###################################################################

# Created by write_sdc on Wed Jul  8 14:52:39 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
set_max_transition 0.6 [current_design]
set_max_fanout 4 [get_ports {i_multb[63]}]
set_max_fanout 4 [get_ports {i_multb[62]}]
set_max_fanout 4 [get_ports {i_multb[61]}]
set_max_fanout 4 [get_ports {i_multb[60]}]
set_max_fanout 4 [get_ports {i_multb[59]}]
set_max_fanout 4 [get_ports {i_multb[58]}]
set_max_fanout 4 [get_ports {i_multb[57]}]
set_max_fanout 4 [get_ports {i_multb[56]}]
set_max_fanout 4 [get_ports {i_multb[55]}]
set_max_fanout 4 [get_ports {i_multb[54]}]
set_max_fanout 4 [get_ports {i_multb[53]}]
set_max_fanout 4 [get_ports {i_multb[52]}]
set_max_fanout 4 [get_ports {i_multb[51]}]
set_max_fanout 4 [get_ports {i_multb[50]}]
set_max_fanout 4 [get_ports {i_multb[49]}]
set_max_fanout 4 [get_ports {i_multb[48]}]
set_max_fanout 4 [get_ports {i_multb[47]}]
set_max_fanout 4 [get_ports {i_multb[46]}]
set_max_fanout 4 [get_ports {i_multb[45]}]
set_max_fanout 4 [get_ports {i_multb[44]}]
set_max_fanout 4 [get_ports {i_multb[43]}]
set_max_fanout 4 [get_ports {i_multb[42]}]
set_max_fanout 4 [get_ports {i_multb[41]}]
set_max_fanout 4 [get_ports {i_multb[40]}]
set_max_fanout 4 [get_ports {i_multb[39]}]
set_max_fanout 4 [get_ports {i_multb[38]}]
set_max_fanout 4 [get_ports {i_multb[37]}]
set_max_fanout 4 [get_ports {i_multb[36]}]
set_max_fanout 4 [get_ports {i_multb[35]}]
set_max_fanout 4 [get_ports {i_multb[34]}]
set_max_fanout 4 [get_ports {i_multb[33]}]
set_max_fanout 4 [get_ports {i_multb[32]}]
set_max_fanout 4 [get_ports {i_multb[31]}]
set_max_fanout 4 [get_ports {i_multb[30]}]
set_max_fanout 4 [get_ports {i_multb[29]}]
set_max_fanout 4 [get_ports {i_multb[28]}]
set_max_fanout 4 [get_ports {i_multb[27]}]
set_max_fanout 4 [get_ports {i_multb[26]}]
set_max_fanout 4 [get_ports {i_multb[25]}]
set_max_fanout 4 [get_ports {i_multb[24]}]
set_max_fanout 4 [get_ports {i_multb[23]}]
set_max_fanout 4 [get_ports {i_multb[22]}]
set_max_fanout 4 [get_ports {i_multb[21]}]
set_max_fanout 4 [get_ports {i_multb[20]}]
set_max_fanout 4 [get_ports {i_multb[19]}]
set_max_fanout 4 [get_ports {i_multb[18]}]
set_max_fanout 4 [get_ports {i_multb[17]}]
set_max_fanout 4 [get_ports {i_multb[16]}]
set_max_fanout 4 [get_ports {i_multb[15]}]
set_max_fanout 4 [get_ports {i_multb[14]}]
set_max_fanout 4 [get_ports {i_multb[13]}]
set_max_fanout 4 [get_ports {i_multb[12]}]
set_max_fanout 4 [get_ports {i_multb[11]}]
set_max_fanout 4 [get_ports {i_multb[10]}]
set_max_fanout 4 [get_ports {i_multb[9]}]
set_max_fanout 4 [get_ports {i_multb[8]}]
set_max_fanout 4 [get_ports {i_multb[7]}]
set_max_fanout 4 [get_ports {i_multb[6]}]
set_max_fanout 4 [get_ports {i_multb[5]}]
set_max_fanout 4 [get_ports {i_multb[4]}]
set_max_fanout 4 [get_ports {i_multb[3]}]
set_max_fanout 4 [get_ports {i_multb[2]}]
set_max_fanout 4 [get_ports {i_multb[1]}]
set_max_fanout 4 [get_ports {i_multb[0]}]
create_clock [get_ports i_clk]  -name clock  -period 20  -waveform {0 10}
set_input_delay -clock clock  8  [get_ports {i_multb[63]}]
set_input_delay -clock clock  8  [get_ports {i_multb[62]}]
set_input_delay -clock clock  8  [get_ports {i_multb[61]}]
set_input_delay -clock clock  8  [get_ports {i_multb[60]}]
set_input_delay -clock clock  8  [get_ports {i_multb[59]}]
set_input_delay -clock clock  8  [get_ports {i_multb[58]}]
set_input_delay -clock clock  8  [get_ports {i_multb[57]}]
set_input_delay -clock clock  8  [get_ports {i_multb[56]}]
set_input_delay -clock clock  8  [get_ports {i_multb[55]}]
set_input_delay -clock clock  8  [get_ports {i_multb[54]}]
set_input_delay -clock clock  8  [get_ports {i_multb[53]}]
set_input_delay -clock clock  8  [get_ports {i_multb[52]}]
set_input_delay -clock clock  8  [get_ports {i_multb[51]}]
set_input_delay -clock clock  8  [get_ports {i_multb[50]}]
set_input_delay -clock clock  8  [get_ports {i_multb[49]}]
set_input_delay -clock clock  8  [get_ports {i_multb[48]}]
set_input_delay -clock clock  8  [get_ports {i_multb[47]}]
set_input_delay -clock clock  8  [get_ports {i_multb[46]}]
set_input_delay -clock clock  8  [get_ports {i_multb[45]}]
set_input_delay -clock clock  8  [get_ports {i_multb[44]}]
set_input_delay -clock clock  8  [get_ports {i_multb[43]}]
set_input_delay -clock clock  8  [get_ports {i_multb[42]}]
set_input_delay -clock clock  8  [get_ports {i_multb[41]}]
set_input_delay -clock clock  8  [get_ports {i_multb[40]}]
set_input_delay -clock clock  8  [get_ports {i_multb[39]}]
set_input_delay -clock clock  8  [get_ports {i_multb[38]}]
set_input_delay -clock clock  8  [get_ports {i_multb[37]}]
set_input_delay -clock clock  8  [get_ports {i_multb[36]}]
set_input_delay -clock clock  8  [get_ports {i_multb[35]}]
set_input_delay -clock clock  8  [get_ports {i_multb[34]}]
set_input_delay -clock clock  8  [get_ports {i_multb[33]}]
set_input_delay -clock clock  8  [get_ports {i_multb[32]}]
set_input_delay -clock clock  8  [get_ports {i_multb[31]}]
set_input_delay -clock clock  8  [get_ports {i_multb[30]}]
set_input_delay -clock clock  8  [get_ports {i_multb[29]}]
set_input_delay -clock clock  8  [get_ports {i_multb[28]}]
set_input_delay -clock clock  8  [get_ports {i_multb[27]}]
set_input_delay -clock clock  8  [get_ports {i_multb[26]}]
set_input_delay -clock clock  8  [get_ports {i_multb[25]}]
set_input_delay -clock clock  8  [get_ports {i_multb[24]}]
set_input_delay -clock clock  8  [get_ports {i_multb[23]}]
set_input_delay -clock clock  8  [get_ports {i_multb[22]}]
set_input_delay -clock clock  8  [get_ports {i_multb[21]}]
set_input_delay -clock clock  8  [get_ports {i_multb[20]}]
set_input_delay -clock clock  8  [get_ports {i_multb[19]}]
set_input_delay -clock clock  8  [get_ports {i_multb[18]}]
set_input_delay -clock clock  8  [get_ports {i_multb[17]}]
set_input_delay -clock clock  8  [get_ports {i_multb[16]}]
set_input_delay -clock clock  8  [get_ports {i_multb[15]}]
set_input_delay -clock clock  8  [get_ports {i_multb[14]}]
set_input_delay -clock clock  8  [get_ports {i_multb[13]}]
set_input_delay -clock clock  8  [get_ports {i_multb[12]}]
set_input_delay -clock clock  8  [get_ports {i_multb[11]}]
set_input_delay -clock clock  8  [get_ports {i_multb[10]}]
set_input_delay -clock clock  8  [get_ports {i_multb[9]}]
set_input_delay -clock clock  8  [get_ports {i_multb[8]}]
set_input_delay -clock clock  8  [get_ports {i_multb[7]}]
set_input_delay -clock clock  8  [get_ports {i_multb[6]}]
set_input_delay -clock clock  8  [get_ports {i_multb[5]}]
set_input_delay -clock clock  8  [get_ports {i_multb[4]}]
set_input_delay -clock clock  8  [get_ports {i_multb[3]}]
set_input_delay -clock clock  8  [get_ports {i_multb[2]}]
set_input_delay -clock clock  8  [get_ports {i_multb[1]}]
set_input_delay -clock clock  8  [get_ports {i_multb[0]}]
set_output_delay -clock clock  8  [get_ports {o_product[127]}]
set_output_delay -clock clock  8  [get_ports {o_product[126]}]
set_output_delay -clock clock  8  [get_ports {o_product[125]}]
set_output_delay -clock clock  8  [get_ports {o_product[124]}]
set_output_delay -clock clock  8  [get_ports {o_product[123]}]
set_output_delay -clock clock  8  [get_ports {o_product[122]}]
set_output_delay -clock clock  8  [get_ports {o_product[121]}]
set_output_delay -clock clock  8  [get_ports {o_product[120]}]
set_output_delay -clock clock  8  [get_ports {o_product[119]}]
set_output_delay -clock clock  8  [get_ports {o_product[118]}]
set_output_delay -clock clock  8  [get_ports {o_product[117]}]
set_output_delay -clock clock  8  [get_ports {o_product[116]}]
set_output_delay -clock clock  8  [get_ports {o_product[115]}]
set_output_delay -clock clock  8  [get_ports {o_product[114]}]
set_output_delay -clock clock  8  [get_ports {o_product[113]}]
set_output_delay -clock clock  8  [get_ports {o_product[112]}]
set_output_delay -clock clock  8  [get_ports {o_product[111]}]
set_output_delay -clock clock  8  [get_ports {o_product[110]}]
set_output_delay -clock clock  8  [get_ports {o_product[109]}]
set_output_delay -clock clock  8  [get_ports {o_product[108]}]
set_output_delay -clock clock  8  [get_ports {o_product[107]}]
set_output_delay -clock clock  8  [get_ports {o_product[106]}]
set_output_delay -clock clock  8  [get_ports {o_product[105]}]
set_output_delay -clock clock  8  [get_ports {o_product[104]}]
set_output_delay -clock clock  8  [get_ports {o_product[103]}]
set_output_delay -clock clock  8  [get_ports {o_product[102]}]
set_output_delay -clock clock  8  [get_ports {o_product[101]}]
set_output_delay -clock clock  8  [get_ports {o_product[100]}]
set_output_delay -clock clock  8  [get_ports {o_product[99]}]
set_output_delay -clock clock  8  [get_ports {o_product[98]}]
set_output_delay -clock clock  8  [get_ports {o_product[97]}]
set_output_delay -clock clock  8  [get_ports {o_product[96]}]
set_output_delay -clock clock  8  [get_ports {o_product[95]}]
set_output_delay -clock clock  8  [get_ports {o_product[94]}]
set_output_delay -clock clock  8  [get_ports {o_product[93]}]
set_output_delay -clock clock  8  [get_ports {o_product[92]}]
set_output_delay -clock clock  8  [get_ports {o_product[91]}]
set_output_delay -clock clock  8  [get_ports {o_product[90]}]
set_output_delay -clock clock  8  [get_ports {o_product[89]}]
set_output_delay -clock clock  8  [get_ports {o_product[88]}]
set_output_delay -clock clock  8  [get_ports {o_product[87]}]
set_output_delay -clock clock  8  [get_ports {o_product[86]}]
set_output_delay -clock clock  8  [get_ports {o_product[85]}]
set_output_delay -clock clock  8  [get_ports {o_product[84]}]
set_output_delay -clock clock  8  [get_ports {o_product[83]}]
set_output_delay -clock clock  8  [get_ports {o_product[82]}]
set_output_delay -clock clock  8  [get_ports {o_product[81]}]
set_output_delay -clock clock  8  [get_ports {o_product[80]}]
set_output_delay -clock clock  8  [get_ports {o_product[79]}]
set_output_delay -clock clock  8  [get_ports {o_product[78]}]
set_output_delay -clock clock  8  [get_ports {o_product[77]}]
set_output_delay -clock clock  8  [get_ports {o_product[76]}]
set_output_delay -clock clock  8  [get_ports {o_product[75]}]
set_output_delay -clock clock  8  [get_ports {o_product[74]}]
set_output_delay -clock clock  8  [get_ports {o_product[73]}]
set_output_delay -clock clock  8  [get_ports {o_product[72]}]
set_output_delay -clock clock  8  [get_ports {o_product[71]}]
set_output_delay -clock clock  8  [get_ports {o_product[70]}]
set_output_delay -clock clock  8  [get_ports {o_product[69]}]
set_output_delay -clock clock  8  [get_ports {o_product[68]}]
set_output_delay -clock clock  8  [get_ports {o_product[67]}]
set_output_delay -clock clock  8  [get_ports {o_product[66]}]
set_output_delay -clock clock  8  [get_ports {o_product[65]}]
set_output_delay -clock clock  8  [get_ports {o_product[64]}]
set_output_delay -clock clock  8  [get_ports {o_product[63]}]
set_output_delay -clock clock  8  [get_ports {o_product[62]}]
set_output_delay -clock clock  8  [get_ports {o_product[61]}]
set_output_delay -clock clock  8  [get_ports {o_product[60]}]
set_output_delay -clock clock  8  [get_ports {o_product[59]}]
set_output_delay -clock clock  8  [get_ports {o_product[58]}]
set_output_delay -clock clock  8  [get_ports {o_product[57]}]
set_output_delay -clock clock  8  [get_ports {o_product[56]}]
set_output_delay -clock clock  8  [get_ports {o_product[55]}]
set_output_delay -clock clock  8  [get_ports {o_product[54]}]
set_output_delay -clock clock  8  [get_ports {o_product[53]}]
set_output_delay -clock clock  8  [get_ports {o_product[52]}]
set_output_delay -clock clock  8  [get_ports {o_product[51]}]
set_output_delay -clock clock  8  [get_ports {o_product[50]}]
set_output_delay -clock clock  8  [get_ports {o_product[49]}]
set_output_delay -clock clock  8  [get_ports {o_product[48]}]
set_output_delay -clock clock  8  [get_ports {o_product[47]}]
set_output_delay -clock clock  8  [get_ports {o_product[46]}]
set_output_delay -clock clock  8  [get_ports {o_product[45]}]
set_output_delay -clock clock  8  [get_ports {o_product[44]}]
set_output_delay -clock clock  8  [get_ports {o_product[43]}]
set_output_delay -clock clock  8  [get_ports {o_product[42]}]
set_output_delay -clock clock  8  [get_ports {o_product[41]}]
set_output_delay -clock clock  8  [get_ports {o_product[40]}]
set_output_delay -clock clock  8  [get_ports {o_product[39]}]
set_output_delay -clock clock  8  [get_ports {o_product[38]}]
set_output_delay -clock clock  8  [get_ports {o_product[37]}]
set_output_delay -clock clock  8  [get_ports {o_product[36]}]
set_output_delay -clock clock  8  [get_ports {o_product[35]}]
set_output_delay -clock clock  8  [get_ports {o_product[34]}]
set_output_delay -clock clock  8  [get_ports {o_product[33]}]
set_output_delay -clock clock  8  [get_ports {o_product[32]}]
set_output_delay -clock clock  8  [get_ports {o_product[31]}]
set_output_delay -clock clock  8  [get_ports {o_product[30]}]
set_output_delay -clock clock  8  [get_ports {o_product[29]}]
set_output_delay -clock clock  8  [get_ports {o_product[28]}]
set_output_delay -clock clock  8  [get_ports {o_product[27]}]
set_output_delay -clock clock  8  [get_ports {o_product[26]}]
set_output_delay -clock clock  8  [get_ports {o_product[25]}]
set_output_delay -clock clock  8  [get_ports {o_product[24]}]
set_output_delay -clock clock  8  [get_ports {o_product[23]}]
set_output_delay -clock clock  8  [get_ports {o_product[22]}]
set_output_delay -clock clock  8  [get_ports {o_product[21]}]
set_output_delay -clock clock  8  [get_ports {o_product[20]}]
set_output_delay -clock clock  8  [get_ports {o_product[19]}]
set_output_delay -clock clock  8  [get_ports {o_product[18]}]
set_output_delay -clock clock  8  [get_ports {o_product[17]}]
set_output_delay -clock clock  8  [get_ports {o_product[16]}]
set_output_delay -clock clock  8  [get_ports {o_product[15]}]
set_output_delay -clock clock  8  [get_ports {o_product[14]}]
set_output_delay -clock clock  8  [get_ports {o_product[13]}]
set_output_delay -clock clock  8  [get_ports {o_product[12]}]
set_output_delay -clock clock  8  [get_ports {o_product[11]}]
set_output_delay -clock clock  8  [get_ports {o_product[10]}]
set_output_delay -clock clock  8  [get_ports {o_product[9]}]
set_output_delay -clock clock  8  [get_ports {o_product[8]}]
set_output_delay -clock clock  8  [get_ports {o_product[7]}]
set_output_delay -clock clock  8  [get_ports {o_product[6]}]
set_output_delay -clock clock  8  [get_ports {o_product[5]}]
set_output_delay -clock clock  8  [get_ports {o_product[4]}]
set_output_delay -clock clock  8  [get_ports {o_product[3]}]
set_output_delay -clock clock  8  [get_ports {o_product[2]}]
set_output_delay -clock clock  8  [get_ports {o_product[1]}]
set_output_delay -clock clock  8  [get_ports {o_product[0]}]
